<template>
  <div>
    <span id="timerH">Час: </span>
    <span id="timer">{{time}}</span><br>
    <span id="counter">К-сть правильних відповідей: {{counter}} / 25</span>
    <div class="question">
      <h4 ref="que">{{questions[ques].text}}</h4>
      <div class="buttons">
      <button v-for=" (answ, i) in questions[ques].answers" :key="i" class="btn answ" @click="checkAnswer(questions[ques].answers[i].text), $event.target.blur()">
          {{questions[ques].answers[i].text}}
      </button>
    </div>
  </div>
  </div>
</template>

<script>
import M from 'materialize-css'
export default {
  name: 'Test',
  props:{
    isTest: {
      type: Boolean
    },
    q: Number,
    qCounter: Number
    
  },
  data(){
    return{
      time:60,
      counter:0,
      questionCounter: this.qCounter,
      ques:this.q,
      l:0,
      mark:0,
      tmpQuestions:[],
      test: this.isTest,
      questions:[
        {
        text:"Яку владу вивчає політологія:",
        answers:[
          {text:"владу соціальну"},
          {text:"владу господарську"},
          {text:"владу політичну"},
          {text:"сімейну"}
          ]
        },
        {
        text:"Яку владу вивчає соціологія:",
        answers:[
          {text:"владу соціальну"},
          {text:"владу господарську"},
          {text:"владу політичну"},
          {text:"сімейну"}
          ]
        },
        {
        text:"Політичний переворот характеризується таким поняттям:",
        answers:[
          {text:"революція"},
          {text:"вибори"},
          {text:"путч"},
          {text:"політична реформа"}
          ]
        },
        {
        text:"Як називається форма суспільної влади держави, заснована на її визнанні народом:",
        answers:[
          {text:"диктатура пролетаріату"},
          {text:"охлократія"},
          {text:"демократія"},
          {text:"тиранія"}
          ]
        },
        {
        text:"Назвіть головну ознаку політичної партії:",
        answers:[
          {text:"наявність програми"},
          {text:"виокремлення соціальної бази"},
          {text:"Елітарність"},
          {text:"принцип демократичного централізму"}
          ]
        },
        {
        text:"В чому суть політичної реформи:",
        answers:[
          {text:"корінні зміни суспільно-політичного життя"},
          {text:"еволюційний розвиток суспільства"},
          {text:"перехід від одного рівня політичного розвитку до іншого"},
          {text:"прихід до влади політичних партій"}
          ]
        },
        {
        text:"До яких політичних символів належить гімн:",
        answers:[
          {text:"предметні"},
          {text:"словесні"},
          {text:"поведінкові"},
          {text:"зразкові"}
          ]
        },
        {
        text:"Етакратизм – це влада:",
        answers:[
          {text:"партійних організацій"},
          {text:"сімейна"},
          {text:"держави"},
          {text:"общини"}
          ]
        },
        {
        text:"У якій з ситуацій присутній елемент влади:",
        answers:[
          {text:"порада другові піти подивитись певний фільм"},
          {text:"рекомендація лікаря кинути палити, що має форму наказу"},
          {text:"використання ДАІ дорожних забороняючих знаків (обмеження швидкості)"},
          {text:"прохання про допомогу"}
          ]
        },
        {
        text:"Яке із цих визначень є правильним:",
        answers:[
          {text:"влада – це контроль над поведінкою"},
          {text:"влада – це система ресурсів, за допомогою яких досягаються спільні цілі"},
          {text:"влада – це реальна можливість здійснювати свою волю"},
          {text:"влада – це сукупність джерел управління"}
          ]
        },
        {
        text:"Гілки влади формуються:",
        answers:[
          {text:"демократичним шляхом"},
          {text:"авторитарним"},
          {text:"охлократичним"},
          {text:"тоталітарним"}
          ]
        },
        {
        text:"Розподіл влади на законодавчу, виконавчу і судову є основним елементом:",
        answers:[
          {text:"демократії"},
          {text:"сталінізму"},
          {text:"тоталітаризму"},
          {text:"фашизму"}
          ]
        },
        {
        text:"Однопартійна система притаманна такій країні:",
        answers:[
          {text:"США"},
          {text:"Італія"},
          {text:"Куба"},
          {text:"Англія"}
          ]
        },
        {
        text:"Правозахисний рух в Україні відбувся:",
        answers:[
          {text:"в 50-х рр. ХХ ст."},
          {text:"в 60-х рр. ХХ ст."},
          {text:"в 70-х рр. ХХ ст."},
          {text:"В 80-х рр. ХХ ст."}
          ]
        },
        {
        text:"Виборча система в Україні має таку форму:",
        answers:[
          {text:"пропорційну"},
          {text:"мажоритарну"},
          {text:"змішану"},
          {text:"списки з преференціями"}
          ]
        },
        {
        text:"Що таке „анархізм”:",
        answers:[
          {text:"влада держави"},
          {text:"безвладдя"},
          {text:"влада монарха"},
          {text:"влада куратора"}
          ]
        },
        {
        text:"Здійснюючи зовнішню політику, держава прагне до експансії, намагається вирішити свої внутрішні проблеми за рахунок інших держав. Про який вид зовнішньої політики йдеться:",
        answers:[
          {text:"агресивну"},
          {text:"активну"},
          {text:"пасивну"},
          {text:"консервативну"}
          ]
        },
        {
        text:"Коли відбувся путч в СРСР:",
        answers:[
          {text:"15 серпня 1991 р."},
          {text:"16 серпня 1991 р."},
          {text:"19 серпня 1991 р."},
          {text:"24 серпня 1991 р."}
          ]
        },
        {
        text:"Харизматичний тип влади за М.Вебером – це:",
        answers:[
          {text:"віра у звичаї"},
          {text:"беззастережна віра у вождя"},
          {text:"бюрократичне управління"},
          {text:"віра у традиційне панування"}
          ]
        },
        {
        text:"У президентській республіці уряд несе політичну відповідальність перед:",
        answers:[
          {text:"перед парламентом"},
          {text:"перед президентом"},
          {text:"перед судом"},
          {text:"народом"}
          ]
        },
        {
        text:"Політологія – це система знань",
        answers:[
          {text:"про політику"},
          {text:"про суспільство"},
          {text:"про людину"},
          {text:"про народ"}
          ]
        },
        {
        text:"Що таке категорії:",
        answers:[
          {text:"структура"},
          {text:"терміни"},
          {text:"принципи"},
          {text:"ознаки"}
          ]
        },
        {
        text:"Конфуціанство – це погляди:",
        answers:[
          {text:"Стародавньої Індії"},
          {text:"Стародавнього Китаю"},
          {text:"Стародавнього Риму"},
          {text:"Стародавньої Греції"}
          ]
        },
        {
        text:"Теорію „природного права” визначив:",
        answers:[
          {text:"Н. Макіавеллі"},
          {text:"Т.Гоббс"},
          {text:"Ш.Монтеск'є"},
          {text:"І.Кант"}
          ]
        },
        {
        text:"Імпічмент – це:",
        answers:[
          {text:"процедура притягнення Президента до відповідальності"},
          {text:"процедура приведення Президента до присяги"},
          {text:"процедура нагородження президента"},
          {text:"процедура усунення Президента з посади"}
          ]
        },
        {
        text:"Конституція Пилипа Орлика була написана:",
        answers:[
          {text:"у 1705 р."},
          {text:"у 1725 р."},
          {text:"у 1710 р."},
          {text:"у 1715 р."}
          ]
        },
        {
        text:"Термін „політика” визначив:",
        answers:[
          {text:"Сократ"},
          {text:"Аристотель"},
          {text:"Конфуцій"},
          {text:"Цицерон"}
          ]
        },
        {
        text:"Форма „ідеальної” держави була створена:",
        answers:[
          {text:"Піфагором"},
          {text:"Демокрітом"},
          {text:"Платоном"},
          {text:"Аристотелем"}
          ]
        },
        {
        text:"Яка праця була написана київським митрополитом Іларіоном, що висвітлювала концепцію князівського єдиновладдя:",
        answers:[
          {text:"„Повість минулих літ”"},
          {text:"„Слово про закон і благодать”"},
          {text:"„Слово о полку Ігоревім”"},
          {text:"„Руська правда”"}
          ]
        },
        {
        text:"Консенсус – це:",
        answers:[
          {text:"положення, що обговорюється, приймається більшістю при голосуванні"},
          {text:"воно ставиться на голосування, а приймається шляхом погодження"},
          {text:"воно приймається просто більшістю голосів"},
          {text:"положення, що обговорюється, а приймається рішення одним"}
          ]
        },
        {
        text:"Головною метою зовнішньої політики України є:",
        answers:[
          {text:"залучення іноземних інвестицій"},
          {text:"послідовне відстоювання національних інтересів України на міжнародній арені"},
          {text:"зміцнення воєнної могутності держави"},
          {text:"досягнення домінування в європейському ринку"}
          ]
        },
        {
        text:"Г.Моска та В.Парето розробили теорію:",
        answers:[
          {text:"суспільного договору"},
          {text:"елітарності суспільства"},
          {text:"утворення держави"},
          {text:"теорію народного суверенітету"}
          ]
        },
        {
        text:"Об'єктом політики є:",
        answers:[
          {text:"особистість"},
          {text:"влада"},
          {text:"суспільні групи"},
          {text:"народ"}
          ]
        },
        {
        text:"Теологічна теорія держави середньовіччя - це:",
        answers:[
          {text:"влада духовна"},
          {text:"влада світська"},
          {text:"влада народу"},
          {text:"влада монарха"}
          ]
        },
        {
        text:"Джерелом влади може бути:",
        answers:[
          {text:"держава"},
          {text:"авторитет"},
          {text:"владні інститути"},
          {text:"група людей"}
          ]
        },
        {
        text:"Для якої країни стародавнього світу характерне поєднання різних елементів у формуванні держави:",
        answers:[
          {text:"Китай"},
          {text:"Греція"},
          {text:"Рим"},
          {text:"Індія"}
          ]
        },
        {
        text:"Керівництво зовнішньополітичною діяльністю України здійснює:",
        answers:[
          {text:"Президент України"},
          {text:"Верховна Рада України"},
          {text:"Кабінет Міністрів України"},
          {text:"Народ"}
          ]
        },
        {
        text:"До яких політичних символів належить герб:",
        answers:[
          {text:"предметні"},
          {text:"словесні"},
          {text:"поведінкові"},
          {text:"зразкові"}
          ]
        },
        {
        text:"Держава за Н.Макіавеллі – це:",
        answers:[
          {text:"найвище породження людського розуму"},
          {text:"божественне перед визначення"},
          {text:"надбання народу"},
          {text:"однієї людини"}
          ]
        },
        {
        text:"Наука, що вивчає владу, має назву:",
        answers:[
          {text:"партологія"},
          {text:"біхевіоризм"},
          {text:"кратологія"},
          {text:"ідеологія"}
          ]
        },
        {
        text:"Як називається відмова від участі у виборах і політичній діяльності взагалі:",
        answers:[
          {text:"абсентеїзм"},
          {text:"бойкот"},
          {text:"популізм"},
          {text:"іммобільність"}
          ]
        },
        {
        text:"Хто із філософів доводив відносний характер моралі в політиці:",
        answers:[
          {text:"Фома Аквінський"},
          {text:"Нікколо Макіавеллі"},
          {text:"Еразм Ротердамський"},
          {text:"Джон Локк"}
          ]
        },
        {
        text:"До політичних прав відносять:",
        answers:[
          {text:"свободу віри, думки і слова"},
          {text:"свободу пересування"},
          {text:"право на життя"},
          {text:"право на освіту"}
          ]
        },
        {
        text:"Республіка буває:",
        answers:[
          {text:"парламентська"},
          {text:"абсолютна"},
          {text:"дуалістична"},
          {text:"теологічна"}
          ]
        },
        {
        text:"Аристократія – це:",
        answers:[
          {text:"влада небагатьох багатих"},
          {text:"влада однієї групи"},
          {text:"влада кращих, знатної, привілейованої групи"},
          {text:"влада привілейованої більшості, яка володіє високим майновим цензом"}
          ]
        },
        {
        text:"Яка країна є батьківщиною фашизму:",
        answers:[
          {text:"Радянський Союз"},
          {text:"Італія"},
          {text:"Німеччина"},
          {text:"Франція"}
          ]
        },
        {
        text:"Яку назву має міжнародна організація, зусилля якої спрямовані на розвиток освіти, науки і культури:",
        answers:[
          {text:"ООН"},
          {text:"ЮНЕСКО"},
          {text:"НАТО"},
          {text:"ФАО"}
          ]
        },
        {
        text:"Сучасний тип партійної системи в Україні:",
        answers:[
          {text:"однопартійна"},
          {text:"двопартійна"},
          {text:"двоблокова"},
          {text:"багатопартійна"}
          ]
        },
        {
        text:"Україна за державно-політичним устроєм є:",
        answers:[
          {text:"унітарна держава"},
          {text:"федерація"},
          {text:"конфедерація"},
          {text:"імперія"}
          ]
        },
        {
        text:"Більшість від конституційного складу Верховної Ради України – це:",
        answers:[
          {text:"350 депутатів"},
          {text:"301 депутат"},
          {text:"250 депутатів"},
          {text:"226 депутатів"}
          ]
        },
        {
        text:"На вірі у святість норм, що віддавна керують життям суспільства, базується:",
        answers:[
          {text:"легальний тип легітимного панування"},
          {text:"традиційний тип легітимного панування"},
          {text:"харизматичний тип легітимного панування"},
          {text:"народний тип легітимного панування"}
          ]
        },
        {
        text:"Що таке біхевіоризм:",
        answers:[
          {text:"наука про суспільство"},
          {text:"наука про поведінку"},
          {text:"наука про форми правління"},
          {text:"наука про культуру"}
          ]
        },
        {
        text:"Першим Президентом УНР був:",
        answers:[
          {text:"М.Грушевський"},
          {text:"Л.Кравчук"},
          {text:"Л.Кучма"},
          {text:"В.Винниченко"}
          ]
        },
        {
        text:"Держава встановлює і санкціонує норми, які називають:",
        answers:[
          {text:"моральними"},
          {text:"нормами-звичаями"},
          {text:"корпоративними нормами"},
          {text:"нормами права"}
          ]
        },
        {
        text:"Залежно від місця у системі влади партії підрозділяються на:",
        answers:[
          {text:"опозиційні і легальні"},
          {text:"правлячі й опозиційні"},
          {text:"правлячі і нелегальні"},
          {text:"легальні і нелегальні"}
          ]
        },
        {
        text:"До правого екстремізму відносять:",
        answers:[
          {text:"фашизм"},
          {text:"анархізм"},
          {text:"троцькізм"},
          {text:"сталінізм"}
          ]
        },
        {
        text:"Перші держави виникли:",
        answers:[
          {text:"в ІV ст. до н.е."},
          {text:"в ІV тис. до н. е."},
          {text:"в ІV ст. н. е."},
          {text:"в V ст. н.е."}
          ]
        },
        {
        text:"Кого вважають фундатором української політології:",
        answers:[
          {text:"В.Антоновича"},
          {text:"М.Костомарова"},
          {text:"Т.Шевченка"},
          {text:"М.Драгоманова"}
          ]
        },
        {
        text:"Центральним компонентом політичної системи є:",
        answers:[
          {text:"людина"},
          {text:"політична влада"},
          {text:"політичні партії"},
          {text:"держава"},
          {text:"політичні норми"}
          ]
        },
        {
        text:"Політичний екстремізм – це:",
        answers:[
          {text:"політична боротьба в екстремальних умовах"},
          {text:"непримиренна політична позиція, що не визнає компромісів"},
          {text:"прагнення до використання будь-яких, у тому числі й насильницьких методів у боротьбі за владу"},
          {text:"співробітництво"}
          ]
        },
        {
        text:"Політичні прогнози",
        answers:[
          {text:"завжди впливають на розвиток передбачуваних подій"},
          {text:"впливають на передбачувані події за певних обставин"},
          {text:"ніколи не впливають на майбутні події"},
          {text:"можливо впливають"}
          ]
        },
        {
        text:"Італійський фашизм та німецький нацизм були втіленням:",
        answers:[
          {text:"однієї фашистської ідеології"},
          {text:"різних ідеологій"},
          {text:"однієї ідейно-політичної доктрини"},
          {text:"різних ідейно-політичних доктрин"}
          ]
        },
        {
        text:"Нація – це спільнота, що виникає внаслідок процесів:",
        answers:[
          {text:"модернізації"},
          {text:"інтернаціоналізації"},
          {text:"глобалізації"},
          {text:"націоналізації"}
          ]
        },
        {
        text:"У якій із держав її глава є одночасно главою уряду:",
        answers:[
          {text:"США"},
          {text:"Італія"},
          {text:"ФРН"},
          {text:"Україна"}
          ]
        },
        {
        text:"Головним негативним наслідком націоналізму можна вважати:",
        answers:[
          {text:"прагнення народу до самовизначення"},
          {text:"дроблення великих держав на менші (сепаратизм)"},
          {text:"нетерпимість до інших національних груп (ксенофобія)"},
          {text:"Національна незалежність"}
          ]
        },
        {
        text:"„Артхашастра” – вчення про мистецтво управління - належить:",
        answers:[
          {text:"стародавньому Риму"},
          {text:"стародавній Греції"},
          {text:"стародавньому Китаю"},
          {text:"стародавній Індії"}
          ]
        },
        {
        text:"Коли виникли перші масові політичні партії:",
        answers:[
          {text:"наприкінці ХІХ ст."},
          {text:"після Першої світової війни"},
          {text:"усередині ХУІІІ ст"},
          {text:"після Другої світової війни"}
          ]
        },
        {
        text:"У парламентській республіці уряд несе політичну відповідальність:",
        answers:[
          {text:"перед парламентом"},
          {text:"перед судом"},
          {text:"перед президентом"},
          {text:"перед народом"}
          ]
        },
        {
        text:"Верховна Рада України - вищий орган:",
        answers:[
          {text:"законодавчої влади"},
          {text:"виконавчої влади"},
          {text:"судової влади"},
          {text:"народної влади"}
          ]
        },
        {
        text:"Чи можливе укладання міжнародних договорів, які суперечать Конституції України:",
        answers:[
          {text:"можливе"},
          {text:"можливе лише після внесення відповідних змін до Конституції України"},
          {text:"Неможливе"},
          {text:"Нереальне"}
          ]
        },
        {
        text:"В чому поняття політичної влади ширше за державну:",
        answers:[
          {text:"правом видавати закони"},
          {text:"суверенністю"},
          {text:"забезпечити законні права громадян, їх конституційні свободи"},
          {text:"контролювати уряд"}
          ]
        },
        {
        text:"М. Грушевський визначав форми політичного устрою майбутньої України:",
        answers:[
          {text:"незалежна, самостійна держава"},
          {text:"федеративна республіка"},
          {text:"Унітарна держава"},
          {text:"Конфедерація"}
          ]
        },
        {
        text:"До політичної влади належать:",
        answers:[
          {text:"економічна влада"},
          {text:"сімейна влад"},
          {text:"влада ідеології"},
          {text:"державна влада"}
          ]
        },
        {
        text:"Який з перерахованих методів ПОС використовує для вивчення поведінки людини або соціальних груп:",
        answers:[
          {text:"антропологічний"},
          {text:"системний"},
          {text:"психологічний"},
          {text:"біхевіористський"}
          ]
        },
        {
        text:"Почуття, настрої, інстинкти людей не можуть бути імпульсом політичної діяльності в умовах демократії.",
        answers:[
          {text:"Правильно"},
          {text:"неправильно"},
          {text:"можливо в певній ситуації"},
          {text:"нереально"}
          ]
        },
        {
        text:"Людина за своєю природою є істота політична. Це зазначив:",
        answers:[
          {text:"Геродот"},
          {text:"Платон"},
          {text:"Аристотель"},
          {text:"Конфуцій"}
          ]
        },
        {
        text:"Яку форму правління Аристотель вважав неправильною:",
        answers:[
          {text:"тиранію"},
          {text:"монархію"},
          {text:"олігархію"},
          {text:"демократію"}
          ]
        },
        {
        text:"Верховний Суд України формується:",
        answers:[
          {text:"Президентом України"},
          {text:"Верховною Радою України"},
          {text:"Кабінетом Міністрів України"},
          {text:"З’їздом суддів України"}
          ]
        },
        {
        text:"Електоральна політична діяльність - це:",
        answers:[
          {text:"участь у виборах"},
          {text:"участь у діяльності політичних партій"},
          {text:"участь у діяльності державних органів влади"},
          {text:"участь у акціях політичного характеру"}
          ]
        },
        {
        text:"Хто є главою держави та гарантом конституції у більшості демократичних державах?",
        answers:[
          {text:"Прем’єр- міністр"},
          {text:"Глава церкви"},
          {text:"Президент"},
          {text:"Парламент"}
          ]
        },
        {
        text:"Як називається найбільш впливовий керівний орган ООН?",
        answers:[
          {text:"Генеральна асамблея"},
          {text:"Міжнародний Суд"},
          {text:"Рада Безпеки"},
          {text:"Секретаріат"}
          ]
        },
        {
        text:"За яким політичним режимом Україна є:",
        answers:[
          {text:"Демократична"},
          {text:"тоталітарна"},
          {text:"авторитарна"},
          {text:"олігархічна"}
          ]
        },
        {
        text:"Скільки років поспіль громадянин України може бути Президентом України?",
        answers:[
          {text:"8"},
          {text:"10"},
          {text:"12"},
          {text:"14"}
          ]
        },
        {
        text:"До яких політичних символів належить прапор:",
        answers:[
          {text:"Предметні"},
          {text:"Словесні"},
          {text:"Поведінкові"},
          {text:"Зразкові"}
          ]
        },
        {
        text:"Методологія політології охоплює:",
        answers:[
          {text:"теорії еліт"},
          {text:"філософські теорії політики"},
          {text:"теоріє політичної соціалізації"},
          {text:"методи політології"},
          {text:"теорію соціальних змін"}
          ]
        },
        {
        text:"Головною ознакою двопартійної системи є:",
        answers:[
          {text:"Наявність у країни лише двох партій"},
          {text:"Розкол суспільства на два непримиренні табори, кожен, з яких очолюється своєю політичною партією"},
          {text:"Наявність багатьох партій, з яких лише дві поперемінно перемагають на виборах і одноосібно формують уряд"},
          {text:"Система, за якої уряд формується коаліціями з двох партій"}
          ]
        },
        {
        text:"Референдум – це:",
        answers:[
          {text:"всенародне голосування з важливих питань державного і суспільного життя"},
          {text:"гарантоване право незалежно вирішувати питання місцевого значення"},
          {text:"гарантоване право ефективно вирішувати питання місцевого значення"},
          {text:"реальна здатність місцевих територіальних громад самостійно до вирішення питань"}
          ]
        },
        {
        text:"Хто з відомих політиків визначив, що «Навіть тоді, коли ми не цікавимося політикою, політика цікавиться нами»?",
        answers:[
          {text:"Н. Бонапарт"},
          {text:"У.Черчіль"},
          {text:"М.Грушевський"},
          {text:"В.Винниченко"}
          ]
        },
        {
        text:"На виборній системі базується:",
        answers:[
          {text:"легальний тип легітимного панування"},
          {text:"традиційний тип легітимного панування"},
          {text:"харизматичний тип легітимного панування"},
          {text:"народний тип легітимного панування"}
          ]
        },
        {
        text:"Яка міжнародна організація спрямовує зусилля на дотримання мирних відносин?:",
        answers:[
          {text:"ООН"},
          {text:"ЮНЕСКО"},
          {text:"НАТО"},
          {text:"ФАО"}
          ]
        },
        {
        text:"Який тип еліти властивий сучасним тоталітарним режимам:",
        answers:[
          {text:"«відкрита» політична еліта"},
          {text:"легітимна політична еліта"},
          {text:"«еліта крові»"},
          {text:"Номенклатура"}
          ]
        },
        {
        text:"Цей мислитель Стародавнього Сходу ратував за запровадження жорстких, суворих законів:",
        answers:[
          {text:"Конфуцій"},
          {text:"Мо-цзи"},
          {text:"Лао-цзи"},
          {text:"Шан Ян"}
          ]
        },
        {
        text:"Скільки мов на території України мають статус державної?",
        answers:[
          {text:"Дві"},
          {text:"Одна"},
          {text:"Жодна"},
          {text:"Усі"}
          ]
        },
        {
        text:"Хто першим висунув тезу: «Україна для українців»?",
        answers:[
          {text:"Є.Коновалець"},
          {text:"М.Міхновський"},
          {text:"С.Бандера"},
          {text:"С.Петлюра"}
          ]
        },
        {
        text:"Грецьке слово “ethnos” означає:?",
        answers:[
          {text:"Натовп"},
          {text:"Маса"},
          {text:"Плем’я"},
          {text:"Віче"}
          ]
        },
        {
        text:"Які із названих політичних явищ є елементом політичної культури особи?",
        answers:[
          {text:"Політичні інтереси"},
          {text:"Політичні переконання та ідеали"},
          {text:"Політичні права"},
          {text:"Політичні обов’язки"}
          ]
        },
        {
        text:"Скільки держав входить до Європейського Союзу?",
        answers:[
          {text:"25"},
          {text:"15"},
          {text:"28"},
          {text:"34"}
          ]
        },
        {
        text:"В якому році Україну було прийнято в Раду Європи?",
        answers:[
          {text:"1999 р."},
          {text:"1995 р."},
          {text:"1991 р."},
          {text:"1996 р."}
          ]
        },
        {
        text:"Як називається найбільш впливовий керівний орган ООН?",
        answers:[
          {text:"Секретаріат"},
          {text:"Рада Безпеки"},
          {text:"Генеральна Асамблея"},
          {text:"Міжнародний суд"}
          ]
        },
        {
        text:"Принципом правової держави є…",
        answers:[
          {text:"Державний суверенітет"},
          {text:"Гарантування прав і свобод"},
          {text:"Підтримання правопорядку"},
          {text:"Закріплення існуючих форм власності"}
          ]
        },
        {
        text:"Яка європейська держава є еталоном соціальної держави?",
        answers:[
          {text:"Румунія"},
          {text:"Швеція"},
          {text:"Болгарія"},
          {text:"Угорщина"}
          ]
        },
        {
        text:"Яку країну називають батьківщиною демократії?",
        answers:[
          {text:"Великобританію"},
          {text:"США"},
          {text:"Нідерланди"},
          {text:"Грецію"}
          ]
        },
        {
        text:"У якій із наведених країн виборчий бар’єр для політичних партій є найвищим (10%)?",
        answers:[
          {text:"Туреччині"},
          {text:"Польщі"},
          {text:"Україні"},
          {text:"Молдові"}
          ]
        },
        {
        text:"До політичного лексикону слово партія увійшло за часів:",
        answers:[
          {text:"Римської республіки"},
          {text:"Київської Русі"},
          {text:"Війн Наполеона"},
          {text:"ІІ республіки у Франції"}
          ]
        },
        {
        text:"В якій з цих держав існує біпартизм?",
        answers:[
          {text:"США"},
          {text:"Японія"},
          {text:"ФРН"},
          {text:"Україна"}
          ]
        },
        {
        text:"Коли було прийнято закон «Про політичні партії в Україні»?",
        answers:[
          {text:"28 червня 1996 р."},
          {text:"5 квітня 2001 р."},
          {text:"8 грудня 2004 р."},
          {text:"16 липня 1990 р."}
          ]
        },
        {
        text:"Яким терміном політологи називають таємну угоду вузького кола осіб для досягнення якоїсь політичної мети?",
        answers:[
          {text:"Путч"},
          {text:"Змова"},
          {text:"Імпічмент"},
          {text:"Революція"}
          ]
        },
        {
        text:"Стабільне функціонування демократичних інститутів найкраще забезпечує партійна система:",
        answers:[
          {text:"Однопартійна"},
          {text:"Двопартійна"},
          {text:"Двоблокова"},
          {text:"Багатопартійна"}
          ]
        },
        {
        text:"ФРН за політичним устроєм є:",
        answers:[
          {text:"Унітарна держава"},
          {text:"Федерація"},
          {text:"Конфедерація"},
          {text:"Імперія"}
          ]
        },
        {
        text:"Назвіть окрему політичну дисципліну, тематика дослідження якої – суспільно-політичні організації:",
        answers:[
          {text:"Політологія"},
          {text:"Соціологія"},
          {text:"Партологія"},
          {text:"Фактологія"}
          ]
        },
        {
        text:"Влада, заснована на впливі засобів масової інформації, називається:",
        answers:[
          {text:"геронтократія"},
          {text:"охлократія"},
          {text:"плутократія"},
          {text:"медіакратія"}
          ]
        },
        {
        text:"Прапор, герб, гімн - це:",
        answers:[
          {text:"стереотипи"},
          {text:"міфи"},
          {text:"архетипи"},
          {text:"символи"}
          ]
        },
        {
        text:"Збройна боротьба, у яку включені країни й великі маси людей:",
        answers:[
          {text:"заколот"},
          {text:"війна"},
          {text:"конфлікт"},
          {text:"революція"}
          ]
        },
        {
        text:"Теократичною монархією є:",
        answers:[
          {text:"Іспанія"},
          {text:"Оман"},
          {text:"Бахрейн"},
          {text:"Ватикан"}
          ]
        },
        {
        text:"До якого типу партійних систем, за Д. Сарторі, можна віднести партійну систему України:",
        answers:[
          {text:"однопартійна"},
          {text:"двопартійна"},
          {text:"поміркованого плюралізму"},
          {text:"поляризованого плюралізму"}
          ]
        },
        {
        text:"Яка з перелічених країн має двопалатний парламент:",
        answers:[
          {text:"Великобританія"},
          {text:"Україна"},
          {text:"Ізраїль"},
          {text:"Грузія"}
          ]
        },
        {
        text:"Першим періодом розвитку української політичної думки є ?",
        answers:[
          {text:"Політична думка Литовсько-Польського періоду"},
          {text:"Політична думка XVIII-XIX ст."},
          {text:"Політична думка періоду Київської Русі"},
          {text:"Політична думка незалежної України"}
          ]
        },
        {
        text:"Ким започаткована теорія легітимності?",
        answers:[
          {text:"Ш. Монтеск'є"},
          {text:"Дж. Локк"},
          {text:"М. Вебер"},
          {text:"Н. Макіавеллі"}
          ]
        },
        {
        text:"Якому мислителю належить формулювання 'Людина -політична істота':",
        answers:[
          {text:"Августин"},
          {text:"Конфуцій"},
          {text:"Арістотель"},
          {text:"Платон"}
          ]
        },
        {
        text:"Назвіть чисельність членів законодавчого органу України?",
        answers:[
          {text:"400"},
          {text:"250"},
          {text:"300"},
          {text:"450"}
          ]
        },
        {
        text:"Процес політичної соціалізації особистості триває :",
        answers:[
          {text:"в юності"},
          {text:"в зрілому віці"},
          {text:"в дитинстві"},
          {text:"впродовж усього життя індивіда"}
          ]
        },
        {
        text:"Теорію лідера-надлюдини розвинув:",
        answers:[
          {text:"К. Маркс"},
          {text:"Ф. Ніцше"},
          {text:"Г. Тард"},
          {text:"М. Вебер"}
          ]
        },
        {
        text:"Вінницька міська рада належить до:",
        answers:[
          {text:"органів виконавчої влади"},
          {text:"органів законодавчої влади"},
          {text:"органів місцевого самоврядування"},
          {text:"органів судової влади"}
          ]
        },
        {
        text:"З 2014 р. Україна є :",
        answers:[
          {text:"президентською республікою"},
          {text:"парламентсько-президентською республікою"},
          {text:"президентсько-парламентською республікою"},
          {text:"парламентською республікою"}
          ]
        },
        {
        text:"Головна мета діяльності політичної партії визначається:",
        answers:[
          {text:"тиском на органи державної влади з метою досягнення певних потреб та інтересів"},
          {text:"ініціюванням соціальних змін"},
          {text:"боротьбою за політичну владу"},
          {text:"авторитетною і точною оцінкою політичної ситуації в суспільстві"}
          ]
        },
        {
        text:"До громадських органів відносять:",
        answers:[
          {text:"профспілки"},
          {text:"творчі союзи"},
          {text:"комітети захисту миру"},
          {text:"молодіжні організації"}
          ]
        },
        {
        text:"Україна приєдналась до Договору про нерозповсюдження ядерної зброї в :",
        answers:[
          {text:"1999 р."},
          {text:"1995 р."},
          {text:"1994 р."},
          {text:"1996 р."}
          ]
        },
        {
        text:"Однопартійна система притаманна такій країні:",
        answers:[
          {text:"США"},
          {text:"Італія"},
          {text:"Китай"},
          {text:"Англія"}
          ]
        },
        {
        text:"Поняття «суб’єкт міжнародних відносин» можна віднести до:",
        answers:[
          {text:"сучасної демократичної держави"},
          {text:"тоталітарної держави колишнього «соціалістичного табору» європейської монархії часів феодалізму"},
          {text:"римської імперії"},
          {text:"всіх вищезазначених держав"}
          ]
        },
        {
        text:"Форма „ідеальної” держави була створена:",
        answers:[
          {text:"Піфагором"},
          {text:"Демокрітом"},
          {text:"Платоном"},
          {text:"Аристотелем"}
          ]
        },
        {
        text:"В якій країні суспільство поділено на варни:",
        answers:[
          {text:"стародавній Рим"},
          {text:"стародавня Греція"},
          {text:"стародавній Китай"},
          {text:"стародавня Індія"}
          ]
        },
        {
        text:"Хто створив філософську школу - Академу:",
        answers:[
          {text:"Сократ"},
          {text:"Платон"},
          {text:"Аристотель"},
          {text:"Геродот"}
          ]
        },
        {
        text:"Хто створив філософську школу - Лікей:",
        answers:[
          {text:"Сократ"},
          {text:"Платон"},
          {text:"Аристотель"},
          {text:"Геродот"}
          ]
        },
        {
        text:"Яким терміном характеризують ненависть індивідів до інших етносів, людей іншої національності?",
        answers:[
          {text:"експансія"},
          {text:"ксенофобія"},
          {text:"денацифікація"},
          {text:"преференція"}
          ]
        },
        {
        text:"Засновником консервативної ідеології є:",
        answers:[
          {text:"Дж.Локк"},
          {text:"Е.Берк"},
          {text:"К.Маркс"},
          {text:"Ф.Ніцше"}
          ]
        },
        {
        text:"Засновником сучасної конфліктології є:",
        answers:[
          {text:"Е.Дюркгейм"},
          {text:"В.Парето"},
          {text:"К.Боулдінг"},
          {text:"Р.Арон"}
          ]
        },
        {
        text:"Засновником сучасної геополітики є:",
        answers:[
          {text:"Е.Дюркгейм"},
          {text:"К.Маркс"},
          {text:"К.Гаусгофер"},
          {text:"Р.Арон"}
          ]
        },
        {
        text:"Скільки держав входить до НАТО?",
        answers:[
          {text:"25"},
          {text:"29"},
          {text:"28"},
          {text:"34"}
          ]
        },
        {
        text:"Скільки держав входить до складу Ради Європи?",
        answers:[
          {text:"25"},
          {text:"29"},
          {text:"28"},
          {text:"47"}
          ]
        },
        {
        text:"Хто з українських учених відстоював ідеї націонал-комунізму?",
        answers:[
          {text:"Д. Донцов"},
          {text:"Д. Дорошенко"},
          {text:"В.Винниченко"},
          {text:"М.Хвильовий"}
          ]
        },
        {
        text:"До якого напрямку політичної думки належав М.Грушевський?",
        answers:[
          {text:"Народництва"},
          {text:"Лібералізму"},
          {text:"Консерватизму"},
          {text:"Панславізму"}
          ]
        },
        {
        text:"Хто з українських вчених досліджував історію розвитку української ідеї?",
        answers:[
          {text:"М.Грушевський"},
          {text:"В.Винниченко"},
          {text:"Д. Донцов"},
          {text:"М.Костомаров"}
          ]
        },
        {
        text:"Політика як соціальне явище та наукове поняття виникає у :",
        answers:[
          {text:"Період античності"},
          {text:"Епоху Середньовіччя"},
          {text:"Епоху Відродження"},
          {text:"Період пізнього капіталізму"},
          {text:"Період становлення капіталістичних відносин"}
          ]
        },
        {
        text:"Що можна розглядати як підвалини легітимності влади:",
        answers:[
          {text:"Страх"},
          {text:"Примус, насильство"},
          {text:"Довіру і підтримку населення"},
          {text:"Закон"}
          ]
        },
        {
        text:"Яке із положень характеризує тільки демократичний політичний режим?",
        answers:[
          {text:"регламентація всіх сфер суспільного життя"},
          {text:"існування єдиної демократичної ідеології"},
          {text:"реалізація принципу розподілу влади"},
          {text:"багатопартійність"}
          ]
        },
        {
        text:"Автором терміна «тоталітаризм» щодо характеристики політичного режиму є:",
        answers:[
          {text:"Б. Муссоліні"},
          {text:"Д. Джентіле"},
          {text:"К. Фрідріх"},
          {text:"Й. Сталін"}
          ]
        },
        {
        text:"Політичний режим, при якому політична влада здійснюється конкретною особою (сім'єю, партією, соціальним класом) при мінімальній участі народу, називається:",
        answers:[
          {text:"Авторитарним"},
          {text:"теократичним"},
          {text:"демократичним"},
          {text:"тоталітарним"}
          ]
        },
        {
        text:"Режим якої з названих країн можна визначити як теократичний?",
        answers:[
          {text:"Індії"},
          {text:"Туреччини"},
          {text:"Ірану"},
          {text:"Іраку"}
          ]
        },
        {
        text:"На вірі у винятковий талант політичного лідера базується:",
        answers:[
          {text:"легальний тип легітимності"},
          {text:"традиційний тип легітимності"},
          {text:"харизматичний тип легітимності"},
          {text:"універсальній легітимності"}
          ]
        },
        {
        text:"Кому належить виокремлення харизматичного типу лідерства?",
        answers:[
          {text:"К.Марксу"},
          {text:"Г.В.Ф. Гегелю"},
          {text:"Ф.Ніцше"},
          {text:"М.Веберу"}
          ]
        },
        {
        text:"Основні категорії політології традиційно розподіляють на:",
        answers:[
          {text:"загальні та структурні"},
          {text:"центральні, структурні, функціонування та розвитку"},
          {text:"функціонування, розвитку і прогнозування"},
          {text:"системні, структурно-функціональні, соціально-політичні"}
          ]
        },
        {
        text:"Які основні функції політології:",
        answers:[
          {text:"теоретико-пізнавальна, світоглядна, методологічна, прикладна, прогностична"},
          {text:"регулятивна, теоретико-пізнавальна та прогностична"},
          {text:"світоглядна, виховна, гносеологічна, методологічна"},
          {text:"комунікативна, організаційна, світоглядна, консолідуюча"}
          ]
        },
        {
        text:"Що є предметом вивчення політології:",
        answers:[
          {text:"взаємовідносини між політичними партіями та іншими політичними інститутами"},
          {text:"взаємовідносини між політичними партіями і громадськими об’єднаннями"},
          {text:"політика та її взаємовідносини з людиною та суспільством"},
          {text:"державна влада"}
          ]
        },
        {
        text:"У якій країні була створена перша школа політичної науки:",
        answers:[
          {text:"США"},
          {text:"Греція"},
          {text:"Франція"},
          {text:"СРСР"}
          ]
        },
        {
        text:"Форми політики:",
        answers:[
          {text:"внутрішня і зовнішня"},
          {text:"політика держави, партії, особи"},
          {text:"стійкість і стабільність регулювання політичної поведінки людей"},
          {text:"відкрита, закрита"}
          ]
        },
        {
        text:"Проявом політичного відчуження є:",
        answers:[
          {text:"толерантність"},
          {text:"членство в політичному об’єднанні"},
          {text:"політичне моралізування"},
          {text:"абсеїнтизм"}
          ]
        },
        {
        text:"Головним принципом демократії є:",
        answers:[
          {text:"антропологічно-соціальний принцип"},
          {text:"принцип більшості"},
          {text:"принцип ефективності і контролю"},
          {text:"принцип незалежності"}
          ]
        },
        {
        text:"Об’єкт влади:",
        answers:[
          {text:"інститути держави і недержавні структурні елементи"},
          {text:"інститути держави"},
          {text:"ті, хто виконує рішення, розпорядження суб’єктів влади"},
          {text:"активний учасник політичного процесу"}
          ]
        },
        {
        text:"Основні типи політичних режимів:",
        answers:[
          {text:"демократія, аристократія, тиранія"},
          {text:"авторитаризм, тоталітаризм, демократія"},
          {text:"авторитаризм, тоталітаризм, демократія, лібералізм"},
          {text:"республіканський, демократичний, антидемократичний"}
          ]
        },
        {
        text:"Політична соціалізація це:",
        answers:[
          {text:"стимулювання соціуму до участі у політичному житті"},
          {text:"сукупність процесів становлення політичної позиції"},
          {text:"вирішення політиками соціальних питань"},
          {text:"політичний вплив"}
          ]
        },
        {
        text:"Які маніпулятивні можливості однопартійної системи:",
        answers:[
          {text:"відсутність реального багатоманіття політичних симпатій у суспільстві"},
          {text:"односторонні переваги в доступі до засобів масової інформації"},
          {text:"домінування силових методів регулювання конфліктів"},
          {text:"усе з перечисленого"}
          ]
        },
        {
        text:"Пропорційна виборча система сприяє:",
        answers:[
          {text:"збереженню існуючої кількості політичних партій"},
          {text:"зменшенню кількості політичних партій"},
          {text:"зростанню кількості політичних партій і об’єднань"},
          {text:"взагалі не впливає на ці процеси"}
          ]
        },
        {
        text:"Типи політичної культури за Г. Алмондом і С. Вербою:",
        answers:[
          {text:"патріархальна, підданська, активістська"},
          {text:"національна, міжнародна, регіональна"},
          {text:"індивідуалістська, колективістська, інтегративна"},
          {text:"тоталітарна, демократична; ліберальна"}
          ]
        },
        {
        text:"Загальний курс держави в міжнародних справах:",
        answers:[
          {text:"внутрішня політика"},
          {text:"дипломатія"},
          {text:"політичне співробітництво"},
          {text:"зовнішня політика"}
          ]
        },
        {
        text:"Який із цих державних органів відповідає за зовнішню політику держави:",
        answers:[
          {text:"МВС"},
          {text:"Рада юстиції"},
          {text:"МЗС"},
          {text:"Верховна Рада"}
          ]
        },
        {
        text:"В розробці якої міжнародної організації Україна не приймала участі:",
        answers:[
          {text:"ООН"},
          {text:"СНД"},
          {text:"МАГАТЕ"},
          {text:"Антанта"}
          ]
        },
        {
        text:"Хто може бути суб’єктом міжнародного права і здійснювати безпосередні відносини з іншими державами:",
        answers:[
          {text:"Країни"},
          {text:"блоки"},
          {text:"партії"},
          {text:"політичні лідери"}
          ]
        },
        {
        text:"Що з названого не є формою міжнародної політики:",
        answers:[
          {text:"дипломатія"},
          {text:"війна"},
          {text:"революція"},
          {text:"зовнішньополітична пропаганда"}
          ]
        },
        {
        text:"Хто з названих мислителів висунув принцип народного суверенітету як основний принцип республіканського ладу?",
        answers:[
          {text:"Т. Гоббс"},
          {text:"Дж. Локк"},
          {text:"Ш. Монтеск'є"},
          {text:"Ж-Ж. Руссо"}
          ]
        },
        {
        text:"Хто з гетьманів підписав договір між Росією й Україною?",
        answers:[
          {text:"Б. Хмельницький"},
          {text:"П. Сагайдачний"},
          {text:"И. Мазепа"},
          {text:"П. Дорошенко"}
          ]
        },
        {
        text:"Соціалізація:",
        answers:[
          {text:"набуття соціального досвіду"},
          {text:"форма соціальної взаємодії"},
          {text:"поведінка особи в умовах суспільства"},
          {text:"надзвичайні обставини"}
          ]
        },
        {
        text:"Соціальний конфлікт – це:",
        answers:[
          {text:"збройне зіткнення"},
          {text:"відсутність взаєморозуміння"},
          {text:"протистояння різних політичних сил"},
          {text:"сутичка інтересів різних соціальних груп"}
          ]
        },
        {
        text:"Праця Н. Макіавеллі «Володар» була настільною книгою...",
        answers:[
          {text:"Йосипа Сталіна"},
          {text:"Пол Пота"},
          {text:"Кім Чен Іра"},
          {text:"Міклоша Хорті"}
          ]
        },
        {
        text:"Соціологія як наука виникла:",
        answers:[
          {text:"в першій половині ХІХ ст."},
          {text:"у ХVІІІ ст."},
          {text:"після Другої світової війни"},
          {text:"на початку ХХ ст."}
          ]
        },
        {
        text:"Термін «соціологія» запропонував і вперше використав у своїх творах:",
        answers:[
          {text:"О.Конт"},
          {text:"Е.Дюркгейм"},
          {text:"К.Маркс"},
          {text:"Г.Спенсер"}
          ]
        },
        {
        text:"Що є ознаками успадкованого статусу:",
        answers:[
          {text:"Національність"},
          {text:"стать"},
          {text:"освіта"},
          {text:"кваліфікація"}
          ]
        },
        {
        text:"Чим характеризується полігамний шлюб:",
        answers:[
          {text:"об’єднанням в одній родині кількох поколінь"},
          {text:"наявністю великої кількості дітей"},
          {text:"попередньою домовленістю батьків"},
          {text:"наявністю в особи кількох чоловіків/дружин"}
          ]
        },
        {
        text:"Як із позицій розподілу влади в родині можна визначити як матріархат:",
        answers:[
          {text:"домінування чоловіків"},
          {text:"влада дітей"},
          {text:"домінування жінок"},
          {text:"влада чоловіка і жінки"}
          ]
        },
        {
        text:"Коли завершується процес соціалізації:",
        answers:[
          {text:"з початком трудової діяльності"},
          {text:"з закінченням школи"},
          {text:"з досягненням повноліття"},
          {text:"по завершенні життя"}
          ]
        },
        {
        text:"Хто з українських вчених значну увагу приділяв політичній соціології?",
        answers:[
          {text:"М.Драгоманов"},
          {text:"Б.Кістяківський"},
          {text:"М.Грушевський"},
          {text:"С.Подолинський"}
          ]
        },
        {
        text:"Яка наука розглядає суто соціальні характеристики особистості?",
        answers:[
          {text:"Історія"},
          {text:"Політологія"},
          {text:"Соціологія"},
          {text:"Психологія"}
          ]
        },
        {
        text:"Яку сім’ю називають нуклеарною:",
        answers:[
          {text:"до якої входять тільки батьки і їхні діти"},
          {text:"складається із одностатевих партнерів"},
          {text:"поєднує батьків, дітей та інших родичів"},
          {text:"подружжя без дітей"}
          ]
        },
        {
        text:"Що таке поліандрія? Це шлюб:",
        answers:[
          {text:"Між однією жінкою і кількома чоловіками"},
          {text:"Між чоловіком і кількома жінками"},
          {text:"Між кількома чоловіками і кількома жінками"},
          {text:"Між одним чоловіком і однією жінкою"}
          ]
        },
        {
        text:"Полігінія – це шлюб:",
        answers:[
          {text:"Між однією жінкою і кількома чоловіками"},
          {text:"Між чоловіком і кількома жінками"},
          {text:"Між кількома чоловіками і кількома жінками"},
          {text:"Між одним чоловіком і однією жінкою"}
          ]
        },
        {
        text:"Що таке компроміс як шлях вирішення конфлікту:",
        answers:[
          {text:"нав’язування іншій стороні кращого для себе рішення"},
          {text:"часткові поступки конфліктантів, відмова від окремих вимог, що висувалися раніше, готовністю визнати претензії іншої сторони"},
          {text:"вимушена або добровільна відмова від боротьби"},
          {text:"спроба вийти з конфлікту за мінімальних втрат"}
          ]
        },
        ],
      ans:[
        "владу політичну",
        "владу соціальну",
        "путч",
        "демократія",
        "наявність програми",
        "еволюційний розвиток суспільства",
        "словесні",
        "держави",
        "використання ДАІ дорожних забороняючих знаків (обмеження швидкості)",
        "влада – це реальна можливість здійснювати свою волю",
        "демократичним шляхом",
        "демократії",
        "Куба",
        "в 70-х рр. ХХ ст.",
        "змішану",
        "безвладдя",
        "агресивну",
        "19 серпня 1991 р.",
        "беззастережна віра у вождя",
        "перед президентом",
        "про політику",
        "терміни",
        "Стародавнього Китаю",
        "Т.Гоббс",
        "процедура усунення Президента з посади",
        "у 1710 р.",
        "Аристотель",
        "Платоном",
        "„Слово про закон і благодать”",
        "воно ставиться на голосування, а приймається шляхом погодження",
        "послідовне відстоювання національних інтересів України на міжнародній арені",
        "елітарності суспільства",
        "влада",
        "влада духовна",
        "авторитет",
        "Рим",
        "Президент України",
        "предметні",
        "найвище породження людського розуму",
        "кратологія",
        "абсентеїзм",
        "Нікколо Макіавеллі",
        "свободу віри, думки і слова",
        "парламентська",
        "влада кращих, знатної, привілейованої групи",
        "Італія",
        "ЮНЕСКО",
        "багатопартійна",
        "унітарна держава",
        "301 депутат",
        "традиційний тип легітимного панування",
        "наука про поведінку",
        "М.Грушевський",
        "нормами права",
        "правлячі й опозиційні",
        "фашизм",
        "в ІV тис. до н. е.",
        "М.Драгоманова",
        "держава",
        "непримиренна політична позиція, що не визнає компромісів",
        "впливають на передбачувані події за певних обставин",
        "однієї ідейно-політичної доктрини",
        "інтернаціоналізації",
        "США",
        "нетерпимість до інших національних груп (ксенофобія)",
        "стародавній Індії",
        "наприкінці ХІХ ст.",
        "перед парламентом",
        "законодавчої влади",
        "можливе лише після внесення відповідних змін до Конституції України",
        "забезпечити законні права громадян, їх конституційні свободи",
        "федеративна республіка",
        "державна влада",
        "біхевіористський",
        "Правильно",
        "Аристотель",
        "демократію",
        "Верховною Радою України",
        "участь у виборах",
        "Президент",
        "Генеральна асамблея",
        "Демократична",
        "10",
        "Предметні",
        "методи політології",
        "Наявність багатьох партій, з яких лише дві поперемінно перемагають на виборах і одноосібно формують уряд",
        "всенародне голосування з важливих питань державного і суспільного життя",
        "У.Черчіль",
        "легальний тип легітимного панування",
        "ООН",
        "«еліта крові»",
        "Шан Ян",
        "Одна",
        "М.Міхновський",
        "Плем’я",
        "Політичні переконання та ідеали",
        "28",
        "1995 р.",
        "Генеральна Асамблея",
        "Гарантування прав і свобод",
        "Швеція",
        "Грецію",
        "Туреччині",
        "Римської республіки",
        "США",
        "5 квітня 2001 р.",
        "Змова",
        "Двопартійна",
        "Федерація",
        "Партологія",
        "медіакратія",
        "символи",
        "війна",
        "Ватикан",
        "поляризованого плюралізму",
        "Великобританія",
        "Політична думка періоду Київської Русі",
        "М. Вебер",
        "Арістотель",
        "450",
        "впродовж усього життя індивіда",
        "Ф. Ніцше",
        "органів місцевого самоврядування",
        "парламентсько-президентською республікою",
        "боротьбою за політичну владу",
        "комітети захисту миру",
        "1994 р.",
        "Китай",
        "всіх вищезазначених держав",
        "Платоном",
        "стародавня Індія",
        "Платон",
        "Аристотель",
        "ксенофобія",
        "Е.Берк",
        "К.Боулдінг",
        "К.Гаусгофер",
        "29",
        "47",
        "М.Хвильовий",
        "Народництва",
        "Д. Донцов",
        "Період античності",
        "Довіру і підтримку населення",
        "реалізація принципу розподілу влади",
        "Б. Муссоліні",
        "Авторитарним",
        "Ірану",
        "харизматичний тип легітимності",
        "М.Веберу",
        "центральні, структурні, функціонування та розвитку",
        "теоретико-пізнавальна, світоглядна, методологічна, прикладна, прогностична",
        "політика та її взаємовідносини з людиною та суспільством",
        "США",
        "внутрішня і зовнішня",
        "абсеїнтизм",
        "принцип більшості",
        "ті, хто виконує рішення, розпорядження суб’єктів влади",
        "авторитаризм, тоталітаризм, демократія",
        "сукупність процесів становлення політичної позиції",
        "усе з перечисленого",
        "зменшенню кількості політичних партій",
        "патріархальна, підданська, активістська",
        "зовнішня політика",
        "МЗС",
        "Антанта",
        "Країни",
        "революція",
        "Ж-Ж. Руссо",
        "Б. Хмельницький",
        "набуття соціального досвіду",
        "сутичка інтересів різних соціальних груп",
        "Йосипа Сталіна",
        "в першій половині ХІХ ст.",
        "О.Конт",
        "Національність",
        "наявністю в особи кількох чоловіків/дружин",
        "домінування жінок",
        "по завершенні життя",
        "М.Драгоманов",
        "Соціологія",
        "до якої входять тільки батьки і їхні діти",
        "Між однією жінкою і кількома чоловіками",
        "Між чоловіком і кількома жінками",
        "часткові поступки конфліктантів, відмова від окремих вимог, що висувалися раніше, готовністю визнати претензії іншої сторони"
      ]
    }
  },
  methods:{
    timer:function(){
      if(this.test){
        this.l = this.questions.length;
        if (this.time < 0){
          M.toast({html: '<i class="fas fa-times-circle"></i>&nbsp;Неправильна відповідь' , classes:'toastF rounded'});
          this.questionCounter++;
          this.nextQuestion();
        }
      }
      return setTimeout(()=>{
          --this.time
          this.timer()
        }, 1000)
    },
    
    nextQuestion:function(){
      if(this.test){
        console.log(this.test);
      if(this.questionCounter === 25){
        this.result();
        this.test = false;
        this.$emit("testFalse", this.test);
      }
      this.ques = Math.floor(Math.random() * (this.questions.length - 0) + 0);
      this.tmpQuestions.push(this.ques);
      this.$refs.que.innerText = this.questions[this.ques].text;
      this.questionCounter++;
      this.time = 60;
      console.log(this.questionCounter);
      }
    },
    checkAnswer:function(answ){
      if(answ === this.ans[this.ques]){
        M.toast({html: '<i class="fas fa-check-circle"></i>&nbsp;Правильна відповідь' , classes:'toastT rounded', outDuration: 200});
        this.counter++;
        this.nextQuestion();
      }else{
          M.toast({html: '<i class="fas fa-times-circle"></i>&nbsp;Неправильна відповідь' , classes:'toastF rounded' , outDuration: 200})       
          this.nextQuestion();
      }
    },
    result:function(){
      this.mark = (5*this.counter)/25;
      this.$emit("res", this.mark)
    }
  },
  mounted(){
    if(this.test){
      this.timer();
    }
    M.AutoInit();
  }
}
</script>

<style scoped>
h3 {
  margin: 40px 0 0;
}
.answ{
  width: 450px;
  height: 50px;
  font-size: 15px;
  line-height: 1em;
}
#timerH{
  font-size: 30px;
}
#counter{
  font-size: 20px;
}
#timer{
  font-size: 30px;
  font-weight: 800;
  font-family: 'Roboto Mono', monospace;
}
ol {
  list-style-type: none;
  padding: 0;
}
li {
  display: inline-block;
  margin: 0 10px;
}
a {
  color: #42b983;
}
.question{
  text-align: center;
}
button{
  display: block;
  margin-bottom: 10px;
  margin-left: auto;
  margin-right: auto;
}
</style>